{
    "navigation": {
        "about": "O mnie",
        "technologies": "Technologie",
        "projects": "Projekty",
        "contact": "Kontakt"
    },
    "fox": {
        "header": "Michał Lisowiec",
        "subheader": "Junior Front-end Developer",
        "alt": "Lis"
    },
    "about": {
        "title": "O mnie",
        "description": "Cześć, jestem Michał i mieszkam w Bydgoszczy. Programowaniem zainteresowałem się w 2019 roku i rozwijam tę pasję do dzisiaj. Zdecydowałem się na naukę Front-endu, ponieważ zwracam dużą uwagę na wygląd stron internetowych i lubię widzieć efekty swoich działań. W ostatnim czasie zainteresowałem się również optymalizacją stron internetowych pod kątem wydajności i widoczności w wyszukiwarkach. W nowej pracy chciałbym rozwinąć swoje umiejętności w tych dziedzinach",
        "alt": "Ja w alpach"
    },
    "technologies": {
        "title": "Technologie z których korzystam"
    },
    "projects": {
        "title": "Moje projekty",
        "buttonGithub": "Github",
        "buttonLive": "Strona",
        "saper": {
            "title": "Saper",
            "description": "Moja wersja popularnej gry z początku lat 80, którą zna chyba każdy. Do wyboru są 2 poziomy trudności, które różnią się wielkością planszy i ilością bomb. Dodatkowym czynnikiem jest upływający czas.",
            "stack": "HTML, SCSS, JavaScript"
        },
        "quiz": {
            "title": "Quiz",
            "description": "Szybka zabawa na temat znajomości historii. Ten quiz polega na tym, by odgadnąć wszystkich polskich prezydentów. Jedyną podpowiedzą są lata w których dany prezydent urzędował. Jest to pierwszy projekt napisany prze ze mnie w React.",
            "stack": "React, SCSS"
        },
        "top5": {
            "title": "Top 5 leagues",
            "description": "Jako że lubię sport, w moim portfolio nie mogło zabraknąć piłkarskiej aplikacji. Na tej stronie znajdziesz aktualne tabele ligowe, najlepszych strzelców oraz skróty ostatnich meczów z 5 najlepszych lig europejskich. Dane pobrałem z 2 różnych API.",
            "stack": "React, React Router, REST API, SCSS"
        },
        "wtyker": {
            "title": "Wtyker",
            "description": "Projekt nieistniejącego sklepu internetowego z elektroniką. Można w nim filtrować oraz sortować produkty, dodawać je do koszyka, a także złożyć zamówienie.",
            "stack": "React, React Router, Redux, Styled Components"
        },
        "portfolio": {
            "title": "To portolio",
            "description": "Strona na której właśnie się znajdujesz. Prezentuję na niej swoje umiejętności oraz ukończone projekty.",
            "stack": "React, Context API, Bootstrap, EmailJS, Formik, Yup, SCSS"
        },
        "kancelaria": {
            "title": "Kancelaria",
            "description": "Projekt nad którym aktualnie pracuję. Będzie to strona wizytówka kancelarii adwokackiej.",
            "stack": "Next.js, React, Styled Components"
        }
    },
    "contact": {
        "writeMe": {
            "title": "Napisz do mnie",
            "subtitle": "Wypełnij formularz żeby się ze mną skontaktować.",
            "subtitleSending": "Wysyłanie...",
            "subtitleSuccess": "Twoja wiadomość została wysłana. Dziękuję!",
            "subtitleError": "Uuups! Coś poszło nie tak...",
            "emailInput": "Email",
            "nameInput": "Imię",
            "messageInput": "Wiadomość",
            "emailError": "Wpisz swój adres email",
            "emailIncorrect": "Podany email jest nieprawidłowy",
            "nameError": "Wpisz swoje imię",
            "messageError": "Nie wstydź się, przynajmniej się przywitaj :)",
            "buttonMessage": "Wyślij wiadomość"
        },
        "contactInformations": {
            "title": "Informacje kontaktowe",
            "subtitle": "Dowiedz się o mnie więcej lub skontaktuj się w inny sposób."
        }
    }
    
}